#+Title:S3 Como Usar
#+Subtitle:

* criar um bucket
    
   #+NAME:aws s3api create-bucket --bucket my-bucket --region us-east-1
   #+BEGIN_SRC shell :session s1 :results output :exports both
      aws s3api create-bucket --bucket wagner --region us-east-1
   #+END_SRC

   #+RESULTS: aws s3api create-bucket --bucket my-bucket --region us-east-1
   : An error occurred (BucketAlreadyExists) when calling the CreateBucket operation: The requested bucket name is not available. The bucket namespace is shared by all users of the system. Please select a different name and try again.


   se for usar outra regiao, fora da us-east-1 sera necessario usar
   sempre  a opcao LocationConstraint

   
   #+NAME: aws s3api create-bucket --bucket my-bucket --region eu-west-1 --create-bucket-configuration LocationConstraint=eu-west-1
   #+BEGIN_SRC shell :session s1 :results output :exports both
       aws s3api create-bucket --bucket meuS3Bucket --region eu-west-1 --create-bucket-configuration LocationConstraint=eu-west-1
   #+END_SRC


* listar buckets
  
   #+NAME: aws s3api list-buckets --query "Buckets[].Name"
   #+BEGIN_SRC shell :session s1 :results output :exports both
      aws s3api list-buckets --query "Buckets[].Name"
   #+END_SRC

   #+RESULTS: aws s3api list-buckets --query "Buckets[].Name"
   : [
   :     "br.com.fzlbpms",
   :     "br.usp.sin5009",
   :     "ipgg-curso-geronto",
   :     "www.planosdeaulas.com.br"
   : ]
   
   
   #+NAME:aws s3 ls (1)
   #+BEGIN_SRC shell :session s1 :results output :exports both
      echo "[s3 ls]"
      aws s3 ls
      echo "[s3 ls www.planosdeaulas.com.br]"
      aws s3 ls www.planosdeaulas.com.br
   #+END_SRC

   #+RESULTS: aws s3 ls (1)
   : 2019-10-13 18:06:58 br.com.fzlbpms
   : 2019-10-29 14:02:05 br.usp.sin5009
   : 2020-01-19 21:48:17 ipgg-curso-geronto
   : 2020-04-04 17:20:33 www.planosdeaulas.com.br


   
   #+NAME:                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      
   #+END_SRC


